const removeContract = (inputString: string): string => {
  const replacementText = "Договор №**********";
  const regexPattern = `(?<=\\b(?:Договор|Контракт|Акт|Счет|Заказ|Заявка|Приказ|Протокол|Банковская\\sгарантия|Уведомление|Распоряжение|Свидетельство|Паспорт|Платежное\\sпоручение|Справка|Накладная|Реестр|Соглашение|Постановление|Решение|Претензия|Апелляция|Заявление|Устав|Патент|Сертификат|Доверенность)\\s№\\s?)\\d+\n +
  |(?<=Регистрационный\\sномер\\s)\\d+\n +
  |(?<=Регистрационный\\s№\\s?)\\d+\n +
  |(?<=Рег\\s№\\s?)\\d+\n +
  |(?<=№\\d{2}-\\d{2}/)\\d+\n +
  |(?<=№\\d{4}-)\\d{2}\n +
  |(?<=№)\\d{2}/\\d+`;
  const regex = new RegExp(regexPattern, "g");
  return inputString.replace(regex, replacementText);
};

export { removeContract };
