const removePersonData = (inputString: string): string => {
  let text = inputString;

  // Name
  text = text.replace(
    /(?:[А-Я][а-я]+(?:-[А-Я][а-я]+)?\s+[А-Я][а-я]+(?:-[А-Я][а-я]+)?\s+[А-Я][а-я]+(?:-[А-Я][а-я]+)?|[А-Я][а-я]+(?:-[А-Я][а-я]+)?\s+[А-Я]\.\s+[А-Я]\.|[А-Я]\.[А-Я]\.\s+[А-Я][а-я]+(?:-[А-Я][а-я]+)?|[А-Я][а-я]+(?:-[А-Я][а-я]+)?\s+[А-Я]\.\s+[А-Я]\.|[А-Я]\.\s+[А-Я]\.\s+[А-Я][а-я]+(?:-[А-Я][а-я]+)?|[А-Я]\.\s+[А-Я]\.\s+[А-Я][а-я]+(?:-[А-Я][а-я]+)?\s+[А-Я]\.\s+[А-Я]\.|[А-Я]\.[А-Я]\.\s+[А-Я][а-я]+(?:-[А-Я][а-я]+)?|[А-Я][а-я]+(?:-[А-Я][а-я]+)?[А-Я]\.\s+[А-Я]\.|[А-Я][а-я]+(?:-[А-Я][а-я]+)?\s+[А-Я]\.[А-Я]\.)/g,
    "**** ****"
  );

  //Passport
  text = text.replace(/\b\d{4}\s\d{6}\b/g, "**** ****");

  // Email
  /** @error - не работает регулярка*/
  text = text.replace(/[a-zA-Z0-9._%+-]+(?=@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}(?=\s|\p{Punct}))/g, "email@example.com");

  // Phone
  text = text.replace(
    /\+7 \(\d{3}\) \d{3}-\d{2}-\d{2}|\+7 \d{3} \d{3}-\d{2}-\d{2}|\+7 \d{3} \d{3} \d{2} \d{2}|\+7-\d{3}-\d{3}-\d{2}-\d{2}|\+7 \(\d{3}\) \d{3} \d{2} \d{2}|8 \(\d{3}\) \d{3}-\d{2}-\d{2}|8 \d{3} \d{3}-\d{2}-\d{2}|8 \d{3} \d{3} \d{2} \d{2}|8-\d{3}-\d{3}-\d{2}-\d{2}|8 \(\d{3}\) \d{3} \d{2} \d{2}|\(\d{3}\) \d{3}-\d{2}-\d{2}|\d{3} \d{3}-\d{2}-\d{2}|\d{3} \d{3} \d{2} \d{2}|\(\d{3}\) \d{3} \d{2} \d{2}|\d{11}|\+7\d{10}|\+7\s\d{3}-\d{3}-\d{2}-\d{2}|8\d{10}|\+7\s\d{3}\s\d{3}\s\d{2}\s\d{2}|8\s\d{3}-\d{3}-\d{2}-\d{2}|\(\d{4}\)\s\d{2}-\d{2}-\d{3}|\d{4}-\d{2}-\d{3}|8\s\d{4}\s\d{2}\s\d{3}|\+7\s\d{4}\s\d{2}\s\d{3}|\d{2}-\d{2}-\d{4}/g,
    "**********"
  );

  // Postal code 6 цифп
  text = text.replace(/\b\d{6}\b/g, "******");

  return text;
};

export { removePersonData };
